#pragma once

typedef enum _MY_WORK_QUEUE_TYPE {
    CriticalWorkQueue,
    DelayedWorkQueue,
    HyperCriticalWorkQueue,
    NormalWorkQueue,
    BackgroundWorkQueue,
    RealTimeWorkQueue,
    SuperCriticalWorkQueue,
    MaximumWorkQueue,
    CustomPriorityWorkQueue
} MY_WORK_QUEUE_TYPE;

//0x20 bytes (sizeof)
typedef struct _MY_WORK_QUEUE_ITEM
{
    struct _LIST_ENTRY List;                                                //0x0
    VOID(*WorkerRoutine)(VOID* arg1);                                      //0x10
    VOID* Parameter;                                                        //0x18
} MY_WORK_QUEUE_ITEM, * PMY_WORK_QUEUE_ITEM;

//0x40 bytes (sizeof)
typedef struct _MY_KDPC
{
    union
    {
        ULONG TargetInfoAsUlong;                                            //0x0
        struct
        {
            UCHAR Type;                                                     //0x0
            UCHAR Importance;                                               //0x1
            volatile USHORT Number;                                         //0x2
        };
    };
    struct _SINGLE_LIST_ENTRY DpcListEntry;                                 //0x8
    ULONGLONG ProcessorHistory;                                             //0x10
    VOID(*DeferredRoutine)(struct _KDPC* arg1, VOID* arg2, VOID* arg3, VOID* arg4); //0x18
    VOID* DeferredContext;                                                  //0x20
    VOID* SystemArgument1;                                                  //0x28
    VOID* SystemArgument2;                                                  //0x30
    VOID* DpcData;                                                          //0x38
} MY_KDPC, * PMY_KDPC;

typedef struct MY_KSEVENTDATA {
    ULONG NotificationType;
    union {
        struct {
            PMY_WORK_QUEUE_ITEM WorkQueueItem;
            LONGLONG        KsWorkerObject;
            ULONG_PTR        Reserved;
        } KsWorkItem;
    };
} _MY_KSEVENTDATA, * PMY_KSEVENTDATA;

typedef struct MY_KSEVENT_TIME_INTERVAL {
    MY_KSEVENTDATA     EventData;
    LONGLONG        TimeBase;
    LONGLONG        Interval;
} _MY_KSEVENT_TIME_INTERVAL, * PMY_KSEVENT_TIME_INTERVAL;

typedef struct _SYSTEM_HANDLE_TABLE_ENTRY_INFO
{
    USHORT UniqueProcessId;
    USHORT CreatorBackTraceIndex;
    UCHAR ObjectTypeIndex;
    UCHAR HandleAttributes;
    USHORT HandleValue;
    PVOID Object;
    ACCESS_MASK GrantedAccess;
} SYSTEM_HANDLE_TABLE_ENTRY_INFO, * PSYSTEM_HANDLE_TABLE_ENTRY_INFO;

typedef struct _SYSTEM_HANDLE_INFORMATION
{
    ULONG NumberOfHandles;
    _Field_size_(NumberOfHandles) SYSTEM_HANDLE_TABLE_ENTRY_INFO Handles[1];
} SYSTEM_HANDLE_INFORMATION, * PSYSTEM_HANDLE_INFORMATION;

typedef enum _KPROCESSOR_MODE {
    KernelMode,
    UserMode,
} KPROCESSOR_MODE;